#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.perl-show.github_repository.repository: Refreshing state... [id=perl-show]
module.github-demo.github_repository.repository: Refreshing state... [id=tf-github-demo]
module.import-test.github_repository.repository: Refreshing state... [id=import-test]
module.perl-demo.github_repository.repository: Refreshing state... [id=perl-demo]
module.show-import.github_repository.repository: Refreshing state... [id=show-import]
module.repository.github_repository.repository: Refreshing state... [id=demo-repo]
module.discord-bot.github_repository.repository: Refreshing state... [id=discord-bot]
module.perl-show.github_issue_label.label["documentation"]: Refreshing state... [id=perl-show:documentation]
module.perl-show.github_team_repository.team_repository[0]: Refreshing state... [id=8452031:perl-show]
module.perl-show.github_issue_label.label["duplicate"]: Refreshing state... [id=perl-show:duplicate]
module.perl-show.github_issue_label.label["good first issue"]: Refreshing state... [id=perl-show:good first issue]
module.perl-show.github_issue_label.label["enhancement"]: Refreshing state... [id=perl-show:enhancement]
module.perl-show.github_issue_label.label["question"]: Refreshing state... [id=perl-show:question]
module.perl-show.github_issue_label.label["help wanted"]: Refreshing state... [id=perl-show:help wanted]
module.perl-show.github_issue_label.label["invalid"]: Refreshing state... [id=perl-show:invalid]
module.perl-show.github_issue_label.label["bug"]: Refreshing state... [id=perl-show:bug]
module.perl-show.github_issue_label.label["wontfix"]: Refreshing state... [id=perl-show:wontfix]
module.perl-show.github_branch_default.default[0]: Refreshing state... [id=perl-show]
module.github-demo.github_issue_label.label["wontfix"]: Refreshing state... [id=tf-github-demo:wontfix]
module.github-demo.github_issue_label.label["duplicate"]: Refreshing state... [id=tf-github-demo:duplicate]
module.github-demo.github_issue_label.label["help wanted"]: Refreshing state... [id=tf-github-demo:help wanted]
module.github-demo.github_issue_label.label["invalid"]: Refreshing state... [id=tf-github-demo:invalid]
module.github-demo.github_issue_label.label["question"]: Refreshing state... [id=tf-github-demo:question]
module.github-demo.github_issue_label.label["bug"]: Refreshing state... [id=tf-github-demo:bug]
module.github-demo.github_issue_label.label["good first issue"]: Refreshing state... [id=tf-github-demo:good first issue]
module.github-demo.github_issue_label.label["documentation"]: Refreshing state... [id=tf-github-demo:documentation]
module.github-demo.github_issue_label.label["enhancement"]: Refreshing state... [id=tf-github-demo:enhancement]
module.github-demo.github_branch_default.default[0]: Refreshing state... [id=tf-github-demo]
module.discord-bot.github_branch_default.default[0]: Refreshing state... [id=discord-bot]
module.discord-bot.github_branch_protection_v3.branch_protection[0]: Refreshing state... [id=discord-bot:main]
module.discord-bot.github_issue_label.label["bug"]: Refreshing state... [id=discord-bot:bug]
module.discord-bot.github_issue_label.label["invalid"]: Refreshing state... [id=discord-bot:invalid]
module.discord-bot.github_issue_label.label["wontfix"]: Refreshing state... [id=discord-bot:wontfix]
module.discord-bot.github_issue_label.label["documentation"]: Refreshing state... [id=discord-bot:documentation]
module.discord-bot.github_issue_label.label["help wanted"]: Refreshing state... [id=discord-bot:help wanted]
module.discord-bot.github_issue_label.label["duplicate"]: Refreshing state... [id=discord-bot:duplicate]
module.discord-bot.github_issue_label.label["enhancement"]: Refreshing state... [id=discord-bot:enhancement]
module.discord-bot.github_issue_label.label["good first issue"]: Refreshing state... [id=discord-bot:good first issue]
module.discord-bot.github_issue_label.label["question"]: Refreshing state... [id=discord-bot:question]
module.show-import.github_branch_protection_v3.branch_protection[0]: Refreshing state... [id=show-import:main]
module.perl-demo.github_team_repository.team_repository[0]: Refreshing state... [id=8452031:perl-demo]
module.perl-demo.github_branch_default.default[0]: Refreshing state... [id=perl-demo]
module.perl-demo.github_issue_label.label["help wanted"]: Refreshing state... [id=perl-demo:help wanted]
module.perl-demo.github_issue_label.label["enhancement"]: Refreshing state... [id=perl-demo:enhancement]
module.perl-demo.github_issue_label.label["invalid"]: Refreshing state... [id=perl-demo:invalid]
module.perl-demo.github_issue_label.label["bug"]: Refreshing state... [id=perl-demo:bug]
module.perl-demo.github_issue_label.label["good first issue"]: Refreshing state... [id=perl-demo:good first issue]
module.perl-demo.github_issue_label.label["duplicate"]: Refreshing state... [id=perl-demo:duplicate]
module.perl-demo.github_issue_label.label["wontfix"]: Refreshing state... [id=perl-demo:wontfix]
module.perl-demo.github_issue_label.label["question"]: Refreshing state... [id=perl-demo:question]
module.perl-demo.github_issue_label.label["documentation"]: Refreshing state... [id=perl-demo:documentation]
module.perl-show.github_branch_protection_v3.branch_protection[0]: Refreshing state... [id=perl-show:main]
module.github-demo.github_branch_protection_v3.branch_protection[0]: Refreshing state... [id=tf-github-demo:main]
module.perl-demo.github_branch_protection_v3.branch_protection[0]: Refreshing state... [id=perl-demo:main]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.discord-bot.github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                        = "W/\"9429233372233c84ea82ccffbf4a00d4d086aef9b4b4ee365054bd5a0527174f\"" -> "W/\"3aca0be2eaeb997c77d1d556c168c5d4ceca9641fda88e7d49598245d338ac11\""
        id                          = "discord-bot"
        name                        = "discord-bot"
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.github-demo.github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                        = "W/\"f741b631793ce779009facb6eb38465c8055e91968abfcda69704d0b1a4f7d72\"" -> "W/\"f50c8fe83de3a1989e42efd130bb2f332ab54b11b69fa682b760a79bc70ea8b2\""
        id                          = "tf-github-demo"
        name                        = "tf-github-demo"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.import-test.github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                        = "W/\"f5aef0f87afcc2657c8483ea0b4407e046400433782d19c67110e804b6d8e6e2\"" -> "W/\"79bbe37c8d3705e4791c2d55c41606251f9c13524bd43fbb62853e916d1762b7\""
        id                          = "import-test"
        name                        = "import-test"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.perl-demo.github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                        = "W/\"7c1ed955d6a17f41fca2cfbc8eecca3160d6694ff561c061fdc457c5940d5393\"" -> "W/\"0bb65dd205c01487a49ad2fe0b235e4b906e46c41684ac5d05952f25a6cb46b5\""
        id                          = "perl-demo"
        name                        = "perl-demo"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.perl-show.github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                        = "W/\"b513fd1f0f1f273bb5f6557987587f438d3b35c698e4d59c126fb050ba0fe3d4\"" -> "W/\"594af8e08a6a58a04d2a1f7a63e1b47cead8de0821cf0a647b617a647daa0b5b\""
        id                          = "perl-show"
        name                        = "perl-show"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.show-import.github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                        = "W/\"89a42fa6fbe7487d3448339985bc6257c2b20f371bb576c9bb30893afd304630\"" -> "W/\"dab9287d2673950a89a5c4877f90360534be47c1a923ac65de4adaafb63cdd5c\""
        id                          = "show-import"
        name                        = "show-import"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_team.engineers will be created
  + resource "github_team" "engineers" {
      + create_default_maintainer = false
      + description               = "Engineers"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "Engineers"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "secret"
      + slug                      = (known after apply)
    }

  # module.github-demo.github_branch_protection_v3.branch_protection[0] will be updated in-place
  ~ resource "github_branch_protection_v3" "branch_protection" {
        id                              = "tf-github-demo:main"
        # (6 unchanged attributes hidden)

      ~ required_pull_request_reviews {
            # (6 unchanged attributes hidden)

          - bypass_pull_request_allowances {
              - apps  = [] -> null
              - teams = [] -> null
              - users = [
                  - "benpngo",
                ] -> null
            }
        }

      ~ required_status_checks {
          ~ contexts       = [
              + "Terraform Demo Plan",
            ]
            # (3 unchanged attributes hidden)
        }

      ~ restrictions {
          ~ teams = [] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.github-demo.github_branch_protection_v3.branch_protection[1] will be created
  + resource "github_branch_protection_v3" "branch_protection" {
      + branch                          = "feature/*"
      + enforce_admins                  = true
      + etag                            = (known after apply)
      + id                              = (known after apply)
      + repository                      = "tf-github-demo"
      + require_conversation_resolution = false
      + require_signed_commits          = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_users                 = [
              + "benpngo",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "Terraform Demo Plan",
            ]
          + strict   = true
        }

      + restrictions {
          + teams = (known after apply)
        }
    }

  # module.github-demo.github_team_repository.team_repository[0] will be created
  + resource "github_team_repository" "team_repository" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "tf-github-demo"
      + team_id    = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Warning: "required_status_checks.0.contexts": [DEPRECATED] GitHub is deprecating the use of `contexts`. Use a `checks` array instead.

  with module.discord-bot.github_branch_protection_v3.branch_protection[0],
  on .terraform/modules/discord-bot/main.tf line 240, in resource "github_branch_protection_v3" "branch_protection":
 240: resource "github_branch_protection_v3" "branch_protection" {

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @benpngo, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Demo Plan`*